_posts/2021-09-22-abc213-c-upsolving.html
---
title: C - Reorder Cards
tags: AtCoder
---

<div id="outline-container-orgea1f577" class="outline-2">
<h2 id="orgea1f577">C - Reorder Cards</h2>
</div>

<div id="outline-container-orgf020003" class="outline-2">
<h2 id="orgf020003">접근하기</h2>
<div class="outline-text-2" id="text-orgf020003">
<ul class="org-ul">
<li>좌표압축을 묻는 문제</li>
<li>입력받은 W, H는 사용하지 않아도 됨</li>
</ul>
</div>
</div>

<div id="outline-container-orgb8eea5f" class="outline-2">
<h2 id="orgb8eea5f">코드1 - STL vector, erase, unique를 이용한 좌표압축</h2>
<div class="outline-text-2" id="text-orgb8eea5f">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;cstdio&gt;</span>
<span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;vector&gt;</span>
<span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;algorithm&gt;</span>

<span style="color: #729fcf; font-weight: bold;">using</span> <span style="color: #729fcf; font-weight: bold;">namespace</span> <span style="color: #8ae234;">std</span>;

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">H</span>, <span style="color: #ff6347;">W</span>, <span style="color: #ff6347;">N</span>;

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">a</span>[100010];
<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">b</span>[100010];

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #edd400; font-weight: bold;">main</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">argc</span>, <span style="color: #8ae234; font-weight: bold;">char</span>* <span style="color: #ff6347;">argv</span>[])
{
    scanf(<span style="color: #ad7fa8; font-style: italic;">"%d %d %d"</span>, &amp;H, &amp;W, &amp;N);

    <span style="color: #8ae234; font-weight: bold;">vector</span>&lt;<span style="color: #8ae234; font-weight: bold;">int</span>&gt; <span style="color: #ff6347;">va</span>(N); 
    <span style="color: #8ae234; font-weight: bold;">vector</span>&lt;<span style="color: #8ae234; font-weight: bold;">int</span>&gt; <span style="color: #ff6347;">vb</span>(N); 
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=0;i&lt;N;i++) {
        scanf(<span style="color: #ad7fa8; font-style: italic;">"%d"</span>, &amp;a[i]); 
        scanf(<span style="color: #ad7fa8; font-style: italic;">"%d"</span>, &amp;b[i]); 

        va.push_back(a[i]); 
        vb.push_back(b[i]); 
    } 
    sort(va.begin(), va.end());
    va.erase(unique(va.begin(), va.end()), va.end());

    sort(vb.begin(), vb.end());
    vb.erase(unique(vb.begin(), vb.end()), vb.end());

    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=0;i&lt;N;i++) {
        <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">p1</span> = lower_bound(va.begin(), va.end(), a[i]) - va.begin();
        <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">p2</span> = lower_bound(vb.begin(), vb.end(), b[i]) - vb.begin();
        printf(<span style="color: #ad7fa8; font-style: italic;">"%d %d\n"</span>, p1, p2);
    }
    <span style="color: #729fcf; font-weight: bold;">return</span> 0;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org25a4851" class="outline-2">
<h2 id="org25a4851">코드2 - 구조체를 이용해서 풀이</h2>
<div class="outline-text-2" id="text-org25a4851">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;cstdio&gt;</span>
<span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;algorithm&gt;</span>
<span style="color: #729fcf; font-weight: bold;">using</span> <span style="color: #729fcf; font-weight: bold;">namespace</span> <span style="color: #8ae234;">std</span>;

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">H</span>, <span style="color: #ff6347;">W</span>, <span style="color: #ff6347;">N</span>;

<span style="color: #729fcf; font-weight: bold;">typedef</span> <span style="color: #729fcf; font-weight: bold;">struct</span> <span style="color: #8ae234; font-weight: bold;">Node</span>
{
    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">val</span>;
    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">idx</span>;
    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">val2</span>;
} <span style="color: #8ae234; font-weight: bold;">Node</span>;

<span style="color: #8ae234; font-weight: bold;">Node</span> <span style="color: #ff6347;">a</span>[100020];
<span style="color: #8ae234; font-weight: bold;">Node</span> <span style="color: #ff6347;">b</span>[100020];

<span style="color: #8ae234; font-weight: bold;">bool</span> <span style="color: #edd400; font-weight: bold;">cmp1</span>(<span style="color: #8ae234; font-weight: bold;">Node</span>&amp; <span style="color: #ff6347;">p1</span>, <span style="color: #8ae234; font-weight: bold;">Node</span>&amp; <span style="color: #ff6347;">p2</span>)
{
    <span style="color: #729fcf; font-weight: bold;">return</span> (p1.val &lt; p2.val);
}

<span style="color: #8ae234; font-weight: bold;">bool</span> <span style="color: #edd400; font-weight: bold;">cmp2</span>(<span style="color: #8ae234; font-weight: bold;">Node</span>&amp; <span style="color: #ff6347;">p1</span>, <span style="color: #8ae234; font-weight: bold;">Node</span>&amp; <span style="color: #ff6347;">p2</span>)
{
    <span style="color: #729fcf; font-weight: bold;">return</span> (p1.idx &lt; p2.idx);
}

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #edd400; font-weight: bold;">main</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">argc</span>, <span style="color: #8ae234; font-weight: bold;">char</span>* <span style="color: #ff6347;">argv</span>[])
{
    scanf(<span style="color: #ad7fa8; font-style: italic;">"%d %d %d"</span>, &amp;H, &amp;W, &amp;N);

    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=0;i&lt;N;i++) {
        scanf(<span style="color: #ad7fa8; font-style: italic;">"%d %d"</span>, &amp;a[i].val, &amp;b[i].val);
        a[i].idx = i;
        a[i].val2 = 0;

        b[i].idx = i;
        b[i].val2 = 0;
    } 
    sort(a, a+N, cmp1);
    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">cnt</span> = 1;
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=0;i&lt;N;i++) {
        <span style="color: #729fcf; font-weight: bold;">if</span> (i!=0 &amp;&amp; a[i-1].val == a[i].val) {
            a[i].val2 = cnt-1;
        } <span style="color: #729fcf; font-weight: bold;">else</span> {
            a[i].val2 = cnt++;
        }
    }

    sort(b, b+N, cmp1);
    cnt = 1;
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=0;i&lt;N;i++) {
        <span style="color: #729fcf; font-weight: bold;">if</span> (i!=0 &amp;&amp; b[i-1].val == b[i].val) {
            b[i].val2 = cnt - 1;
        } <span style="color: #729fcf; font-weight: bold;">else</span> {
            b[i].val2 = cnt++;
        }
    }

    sort(a, a+N, cmp2);
    sort(b, b+N, cmp2);
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=0;i&lt;N;i++) {
        printf(<span style="color: #ad7fa8; font-style: italic;">"%d %d\n"</span>, a[i].val2, b[i].val2);
    }
    <span style="color: #729fcf; font-weight: bold;">return</span> 0;
}
</pre>
</div>
</div>
</div>
<div id="outline-container-orgdcaff15" class="outline-2">
<h2 id="orgdcaff15">참고자료</h2>
<div class="outline-text-2" id="text-orgdcaff15">
<ul class="org-ul">
<li><a href="https://jason9319.tistory.com/356">좌표압축기법</a></li>
<li><a href="https://blog.hamayanhamayan.com/entry/2021/08/09/010106">좌표압축 설명</a></li>
</ul>
</div>
</div>

<div id="outline-container-org3e5864c" class="outline-2">
<h2 id="org3e5864c">문제 링크</h2>
<div class="outline-text-2" id="text-org3e5864c">
<ul class="org-ul">
<li><a href="https://atcoder.jp/contests/abc213/tasks/abc213_c">https://atcoder.jp/contests/abc213/tasks/abc213_c</a></li>
</ul>
</div>
</div>
